{"data":{"site":{"siteMetadata":{"title":"Blog","author":"Atul R"}},"markdownRemark":{"id":"5f9c65d7-94db-5286-b0a3-ee13f0fbcc69","excerpt":"Shame Shame HTTP!! This act of shaming websites into to switching over to HTTPS has been going on since 2014. \nThere has been a many hastags…","html":"<h2>Shame Shame HTTP!!</h2>\n<p><img src=\"/shame-3f2ae125d14f9a2bce13a8b9cc42063f.gif\" alt=\"Shame\"></p>\n<p>This act of shaming websites into to switching over to HTTPS has been going on since 2014.\nThere has been a many hastags in twitter dedicated for http shaming.\n<a href=\"https://twitter.com/hashtag/httpshame?src=hash\">#HTTPShame</a>, <a href=\"https://twitter.com/hashtag/nomorehttp?src=hash\">#nomorehttp</a>, etc</p>\n<p>Google security blog published <a href=\"https://security.googleblog.com/2018/02/a-secure-web-is-here-to-stay.html\">here</a> in February 2018 states: </p>\n<blockquote>\n<p>Beginning in July 2018 with the release of Chrome 68, Chrome will mark all HTTP sites as “not secure”.\nAnother interesting fact is that Google’s search engine also favoures websites that use encrypted HTTPS connections over HTTP websites.</p>\n</blockquote>\n<p>Oh, and here’s a great quote from this Wikipedia on\n<a href=\"http://en.wikipedia.org/wiki/Salted_duck_egg\">salted duck eggs</a>.</p>\n<blockquote>\n<p>A salted duck egg is a Chinese preserved food product made by soaking duck\neggs in brine, or packing each egg in damp, salted charcoal. In Asian\nsupermarkets, these eggs are sometimes sold covered in a thick layer of salted\ncharcoal paste. The eggs may also be sold with the salted paste removed,\nwrapped in plastic, and vacuum packed. From the salt curing process, the\nsalted duck eggs have a briny aroma, a gelatin-like egg white and a\nfirm-textured, round yolk that is bright orange-red in color.</p>\n</blockquote>\n<p><img src=\"./salty_egg.jpg\" alt=\"Chinese Salty Egg\"></p>\n<p><a href=\"https://www.theregister.co.uk/2018/02/08/google_chrome_http_shame/\">https://www.theregister.co.uk/2018/02/08/google<em>chrome</em>http_shame/</a></p>","frontmatter":{"title":"🔐 HTTPS explained! How you can set it up for local development (without sudo)?","date":"August 04, 2018"},"fields":{"slug":"/localhost-https/"}}},"pageContext":{"slug":"/localhost-https/","previous":null,"next":null}}